CSI API ETABS v1

# cPointObjGetElm Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetElm(
    	string Name,
    	ref string Elm
    )

    Function GetElm (
    	Name As String,
    	ByRef Elm As String
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim Elm As String
    Dim returnValue As Integer

    returnValue = instance.GetElm(Name, Elm)

    int GetElm(
    	String^ Name,
    	String^% Elm
    )

    abstract GetElm :
            Name : string *
            Elm : string byref -> int

#### Parameters

Name

    Type: SystemString

Elm

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com